000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СообщениеКлиенту/СообщениеКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщениеКлиенту</name>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыСообщенийКлиенту</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСообщения</name>
    <type>
      <types>EnumRef.СостояниеСообщенийКлиенту</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСледующейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТегиСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СообщениеКлиенту/ManagerModule.bsl
Процедура ЗаписьСообщенияВРегистр(СтруктураЗаписи, СтарыйИД = "") Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПустаяСтрока(СтруктураЗаписи.Телефон) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не ПустаяСтрока(СтарыйИД) Тогда
			НаборЗаписей = РегистрыСведений.СообщениеКлиенту.СоздатьНаборЗаписей();
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Отбор.Дата.Установить(СтруктураЗаписи.Дата);
			НаборЗаписей.Отбор.ИДСообщения.Установить(СтарыйИД); 
			НаборЗаписей.Записать();
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.СообщениеКлиенту.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Отбор.Дата.Установить(СтруктураЗаписи.Дата);
		НаборЗаписей.Отбор.ИДСообщения.Установить(СтруктураЗаписи.ИДСообщения);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда 
			НоваяЗапись = НаборЗаписей.Добавить();
		Иначе 
			НоваяЗапись = НаборЗаписей[0];
		КонецЕсли;
		
		НоваяЗапись.Дата 					= СтруктураЗаписи.Дата;
		НоваяЗапись.ИДСообщения				= СтруктураЗаписи.ИДСообщения; 
		НоваяЗапись.ТекстСообщения 			= СтруктураЗаписи.ТекстСообщения;
		НоваяЗапись.ТипСообщения 			= СтруктураЗаписи.ТипСообщения;
		НоваяЗапись.СостояниеСообщения 		= СтруктураЗаписи.СостояниеСообщения;
		НоваяЗапись.Телефон 				= СтруктураЗаписи.Телефон;
		НоваяЗапись.ДатаСледующейОтправки 	= СтруктураЗаписи.ДатаСледующейОтправки;
		Если СтруктураЗаписи.Свойство("ТегиСообщения") Тогда 
			НоваяЗапись.ТегиСообщения = СтруктураЗаписи.ТегиСообщения;
		КонецЕсли;	
		
		НаборЗаписей.Записать(Истина); 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;

КонецПроцедуры    

Функция СтруктураЗаписиРегистра() Экспорт 
	
	СтруктураЗаписи = Новый Структура("
		| Дата,
		| ИДСообщения,
		| ТекстСообщения,
		| ТипСообщения,
		| СостояниеСообщения,
		| Телефон,
		| ДатаСледующейОтправки,
		| ТегиСообщения");
	
	Возврат СтруктураЗаписи;
	
КонецФункции
